export const alarmType = ['车载-人脸告警', '卡口-人脸告警', '卡口-车辆告警', '车载-车辆告警', '车辆抓拍'];
export const alarmKeys = ['name', 'baseImage', 'hdpicImage', 'alarmTime', 'address', 'lat', 'lng', 'id', 'indexCode', 'humans', 'reason'];
export const alarmtimes = ['msg', 'alarmTime', 'passTimeStr', 'createDate'];

export const faceByCarMonitor = ['humanName', 'facePicUrl', 'bkgPicUrl', 'alarmTime', 'cameraName', 'lat', 'lng', 'id', 'indexCode', 'humans'];
export const faceByFixedMonitor = ['humanName', 'facePicUrl', 'bkgPicUrl', 'alarmTime', 'cameraName', 'lat', 'lng', 'humanId', 'indexCode', 'humans'];
export const carByFixedMonitor = ['plateInfo', 'picPlate', 'picVehicle', 'passTimeStr', 'crossingName', 'lat', 'lng', 'id', 'indexCode'];
export const carBayCarMonitor = ['cph', 'cpImagerSrc', 'cpImagerSrc', 'createDate', 'cameraName', 'lat', 'lng', 'id', 'indexCode', '', 'bdjg'];


export class AlarmInfo {

  static carByFixedMonitor = {
    platetype: {
      0: '无类型',
      1: '92式民用车',
      2: '警用车',
      3: '上下军车',
      4: '92式武警车',
      5: '左右军车',
      7: '02式个性化车',
      8: '黄色双行尾牌',
      9: '04式新军车',
      10: '使馆车',
      11: '一行结构的新WJ车',
      12: '双行结构的新WJ车',
      13: '黄色1225农用车',
      14: '绿色1325农用车',
      15: '黄色1325农用车',
      16: '摩托车',
      17: '新能源车',
      18: '2012式一行结构新WJ总部车牌类型（单行）',
      19: '2012式两行结构新WJ总部车牌类型（双行）',
      20: '民航车牌类型',
      100: '教练车',
      101: '临时行驶车',
      102: '挂车',
      103: '领馆汽车',
      104: '港澳出入车',
      105: '临时入境车'
    },
    platecolor: {
      0: '白色',
      1: '黄色',
      2: '蓝色',
      3: '黑色',
      4: '其他颜色',
      5: '绿色'
    },
    vehicletype: {
      0: '其他车型',
      1: '客车',
      2: '货车',
      3: '轿车',
      4: '面包车',
      5: '小货车',
      6: '行人',
      7: '二轮车',
      8: '三轮车',
      9: 'SUV/MPV',
      10: '中型客车',
    },
    vehiclecolor: {
      0: '其他颜色',
      1: '白色',
      2: '银色',
      3: '灰色',
      4: '黑色',
      5: '红色',
      6: '深蓝色',
      7: '蓝色',
      8: '黄色',
      9: '绿色',
      10: '棕色',
      11: '粉色',
      12: '紫色',
      13: '深灰色',
      14: '青色',
    },
    alarmAction: {
      '-1': '正常',
      '101': '布控车辆',
      '103': '限时禁行',
      '106': '红名单',
      '1018': '机动车不在机动车道内行驶',
      '1019': '机动车违反规定使用专用车道',
      '1021': '遇机动车排队时插队',
      '1022': '遇机动车排队时超越',
      '1023': '遇机动车排队时未交替驶入车道',
      '1039': '城市道路违法停车',
      '1044': '禁止掉头或左转时掉头',
      '1207': '驾驶摩托车未带安全头盔',
      '1208': '不按导向标志行驶',
      '1211': '压停止线',
      '1223': '驾驶时拨打接听手持电话',
      '1228': '路口滞留',
      '1240': '驾驶人未按规定使用安全带',
      '1301': '机动车逆向行驶',
      '1344': '黄牌车禁限',
      '1345': '机动车违反禁止标线指示',
      '1349': '载客车超速未达 20%',
      '1350': '载货车超速未达20%',
      '1351': '危险品车超速未达20%',
      '1352': '其他车超速未达20%',
      '1355': '机动车在城市快速路上不按车道行驶',
      '1356': '行经人行横道，未减速行驶',
      '1357': '遇行人正在通过人行横道时未停车让行',
      '1358': '行经没有交通信号的道路时，遇行人横过道路未避让',
      '1625': '违反道路交通信号灯通行',
      '1628': '载客车在快速路超速未达20%',
      '1629': '载货车在快速路超速未达20%',
      '1630': '校车在快速路超速未达20%',
      '1631': '危险品车在快速路超速未达20%',
      '1632': '载客车超速未达50%',
      '1633': '载货车超速未达50%',
      '1634': '校车超速未达50%',
      '1635': '危险品车超速未达50%',
      '1636': '其他车超速未达50%',
      '1717': '未悬挂机动车号牌',
      '1718': '故意遮挡机动车号牌',
      '1719': '故意污损机动车号牌',
      '1721': '其他车超速50%以上',
      '1722': '载客车在快速路超速未达50%',
      '1723': '载货车在快速路超速未达50%',
      '1724': '校车在快速路超速未达50%',
      '1725': '危险品车在快速路超速未达50%',
      '1726': '载客车超速50%',
      '1727': '载货车超速50%',
      '1728': '校车超速50%',
      '1729': '危险品车超速50%',
      '4306': '高速上低于规定最低时速',
      '4312': '高速上不按规定车道行驶',
      '4609': '载客车在高速超速未达20%',
      '4610': '载货车在高速超速未达20%',
      '4611': '校车在高速超速未达20%',
      '4612': '危险品车在高速超速未达20%',
      '4613': '高速上违章停车',
      '4614': '高速应急车道停车',
      '4615': '低能见度高速上不按规定行驶',
      '4704': '营运客车高速上停车',
      '4705': '营运客车高速应急车道停车',
      '4706': '载客车在高速超速未达50%',
      '4707': '载货车在高速超速未达50%',
      '4708': '校车在高速超速未达50%',
      '4709': '危险品车在高速超速未达50%',
      '4710': '载客车在高速超速50%',
      '4711': '载货车在高速超速50%',
      '4712': '校车在高速超速50%',
      '4713': '危险品车在高速超速50%%',
      '6023': '非高速不按规定车道行驶',
      '13451': '压线',
      '13453': '违法变道',
      '16251': '绿灯车辆未通过路口停车'
    }
  }

  static faceByFixedMonitor = {
    ageInfo: {
      0: '未知',
      1: '少年',
      2: '青年',
      3: '中年',
      4: '老年'
    },
    glassInfo: {
      0: '未知',
      1: '不戴眼镜',
      2: '戴眼镜'
    },
    smileStatus: {
      0: '未知',
      1: '不微笑',
      2: '微笑'
    },
    sex: {
      0: '未知',
      1: '男',
      2: '女'
    }
  }
}

const imgType = {
  '人脸告警': '姓名',
  '车辆告警': '车牌',
  '车辆抓拍': '抓拍位置',
  '卡口-人脸告警': '姓名',
  '卡口-车辆告警': '车牌',
  '车载-车辆告警': '车牌',
  '车载-人脸告警': '姓名'
}

export const getAlarmType = (type) => {
  return imgType[alarmType[type]]
}
